src/cf/Catalogs/НастройкиОбработкиВидовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиОбработкиВидовОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБизнесСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнтерактивногоСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнтерактивныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидОбъектаСОбработкой</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДействий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияЗапуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстПредупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияПроверкиВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДействия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПредупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АлгоритмыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НаименованиеЭтапа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыИнтерактивныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыИнтерактивныхДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКарточкиТолькоЧтоСозданногоДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКарточкиТолькоЧтоСозданногоВходящегоДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКарточкиТолькоЧтоСозданногоИсходящегоДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтерактивнаяРегистрацияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтерактивнаяРегистрацияВходящегоДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтерактивнаяРегистрацияИсходящегоДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиОбработкиВидовОбъектов/Forms/ПравилоЗапуска/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаНастройку = Параметры.СсылкаНаНастройку;
	
	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаНастройку, 
		"ВидБизнесСобытия, ВидОбъекта, ВидИнтерактивногоСобытия");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Режим автозапуска (%1)'"), СсылкаНаНастройку);
	
	ТипОбъекта = ОбщегоНазначенияДокументооборотКлиентСервер.ТипОбъектаПоТипуВидаОбъекта(
		ТипЗнч(РеквизитыНастройки.ВидОбъекта));
	
	ЗаполнитьВидИнтерактивногоСобытияСписокВыбора();
	ЗаполнитьВидБизнесСобытияСписокВыбора();
	
	ВидБизнесСобытия = РеквизитыНастройки.ВидБизнесСобытия;
	ВидИнтерактивногоСобытия = РеквизитыНастройки.ВидИнтерактивногоСобытия;
	ВидБизнесСобытияПриОткрытии = ВидБизнесСобытия;	
		
	Если ЗначениеЗаполнено(РеквизитыНастройки.ВидБизнесСобытия) 
		И Не ЗначениеЗаполнено(РеквизитыНастройки.ВидИнтерактивногоСобытия) Тогда	
			
		РежимЗапуска = "АвтоматическийЗапуск";
		Элементы.ГруппаВидыИнтерСобытий.Видимость = Ложь;
		Элементы.ГруппаВидыАвтоЗапуска.Видимость = Истина;

	ИначеЕсли (Не ЗначениеЗаполнено(РеквизитыНастройки.ВидБизнесСобытия) 
		И ЗначениеЗаполнено(РеквизитыНастройки.ВидИнтерактивногоСобытия))
		Или (Не ЗначениеЗаполнено(РеквизитыНастройки.ВидБизнесСобытия) 
		И Не ЗначениеЗаполнено(РеквизитыНастройки.ВидИнтерактивногоСобытия)) Тогда
			
		// для пустой настройки - тоже тут покажем. 	
			
		РежимЗапуска = "РучнойЗапуск";
		Элементы.ГруппаВидыИнтерСобытий.Видимость = Истина;
		Элементы.ГруппаВидыАвтоЗапуска.Видимость = Ложь;
		
		Если Не ЗначениеЗаполнено(ВидИнтерактивногоСобытия) Тогда
			ВидИнтерактивногоСобытия = ПредопределенноеЗначение(
				"Перечисление.ВидыИнтерактивныхДействий.ЗакрытиеКарточкиТолькоЧтоСозданногоДокумента");
		КонецЕсли;		
		
	КонецЕсли;		 	
	
	Если Параметры.Свойство("ТолькоПросмотр") Тогда
		ТолькоПросмотр = Параметры.ТолькоПросмотр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Удалить(Команда)
	
	ВидИнтерактивногоСобытия = Неопределено;
	ВидБизнесСобытия = Неопределено;
	
	ОКНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаПриИзменении(Элемент)
	
	Если РежимЗапуска = "АвтоматическийЗапуск" Тогда
		
		Элементы.ГруппаВидыИнтерСобытий.Видимость = Ложь;
		Элементы.ГруппаВидыАвтоЗапуска.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(ВидБизнесСобытия) Тогда
			
			Если ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипыОбъектов.ДокументыПредприятия") Тогда
				
				ВидБизнесСобытия = ПредопределенноеЗначение(
					"Справочник.ВидыБизнесСобытий.РегистрацияДокумента");
					
			ИначеЕсли ТипОбъекта = ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Мероприятия") Тогда
				
				ВидБизнесСобытия = ПредопределенноеЗначение(
					"Справочник.ВидыБизнесСобытий.СозданиеМероприятия");
				
			Иначе
				
				ВызватьИсключение СтрШаблон(
					НСтр("ru = 'Неизвестный тип объекта %1'"),
					ТипОбъекта);
				
			КонецЕсли;
			
		КонецЕсли;
			
		ВидИнтерактивногоСобытия = Неопределено;	

	ИначеЕсли РежимЗапуска = "РучнойЗапуск" Тогда
		
		Элементы.ГруппаВидыИнтерСобытий.Видимость = Истина;
		Элементы.ГруппаВидыАвтоЗапуска.Видимость = Ложь;
		
		ВидБизнесСобытия = Неопределено;
		Если Не ЗначениеЗаполнено(ВидИнтерактивногоСобытия) Тогда
			ВидИнтерактивногоСобытия = ПредопределенноеЗначение(
				"Перечисление.ВидыИнтерактивныхДействий.ЗакрытиеКарточкиТолькоЧтоСозданногоДокумента");
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОКНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	НачатьТранзакцию();
	Попытка
	
		НастройкаОбъект = СсылкаНаНастройку.ПолучитьОбъект();
		
		НастройкаОбъект.ВидБизнесСобытия = ВидБизнесСобытия;
		НастройкаОбъект.ВидИнтерактивногоСобытия = ВидИнтерактивногоСобытия;
		
		НастройкаОбъект.Записать();	
		
		// тут обновим РС ПодпискиНаБизнесСобытия
		Если ЗначениеЗаполнено(ВидБизнесСобытия) Или ЗначениеЗаполнено(ВидБизнесСобытияПриОткрытии) Тогда
			
			ВидБизнесСобытияДляПроверки = ВидБизнесСобытия;
			Если Не ЗначениеЗаполнено(ВидБизнесСобытияДляПроверки) Тогда
				ВидБизнесСобытияДляПроверки = ВидБизнесСобытияПриОткрытии;
			КонецЕсли;	
			
			ДействияСервер.ОбновитьПодпискуНаБизнесСобытия(ВидБизнесСобытияДляПроверки);
			 
		КонецЕсли;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
			
	КонецПопытки;		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВидИнтерактивногоСобытияСписокВыбора()
	
	Если ТипОбъекта = Перечисления.ТипыОбъектов.ДокументыПредприятия Тогда
		
		Элементы.ВидИнтерактивногоСобытия.СписокВыбора.Добавить(
			Перечисления.ВидыИнтерактивныхДействий.ЗакрытиеКарточкиТолькоЧтоСозданногоДокумента,
			НСтр("ru = 'Закрытие карточки только что созданного документа'"));
		Элементы.ВидИнтерактивногоСобытия.СписокВыбора.Добавить(
			Перечисления.ВидыИнтерактивныхДействий.ИнтерактивнаяРегистрацияДокумента,
			НСтр("ru = 'Ручная регистрация документа'"));
		
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Мероприятия Тогда
		
		Элементы.ВидИнтерактивногоСобытия.СписокВыбора.Добавить(
			Перечисления.ВидыИнтерактивныхДействий.ЗакрытиеКарточкиТолькоЧтоСозданногоДокумента,
			НСтр("ru = 'Закрытие карточки только что созданного мероприятия'"));
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный тип объекта %1'"),
			ТипОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидБизнесСобытияСписокВыбора()
	
	Если ТипОбъекта = Перечисления.ТипыОбъектов.ДокументыПредприятия Тогда
		
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.СозданиеДокумента,
			НСтр("ru = 'Создание нового документа'"));
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.ИзменениеДокумента,
			НСтр("ru = 'Изменение документа'"));
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.РегистрацияДокумента,
			НСтр("ru = 'Регистрация документа'"));
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.ПеререгистрацияДокумента,
			НСтр("ru = 'Перерегистрация документа'"));
		
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Мероприятия Тогда
		
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.СозданиеМероприятия,
			НСтр("ru = 'Создание нового мероприятия'"));
		Элементы.ВидБизнесСобытия.СписокВыбора.Добавить(
			Справочники.ВидыБизнесСобытий.ИзменениеМероприятия,
			НСтр("ru = 'Изменение мероприятия'"));
			
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный тип объекта %1'"),
			ТипОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
